# 12. Machine learning techniques

In [30]:
!git clone https://github.com/s7s/machine_learning_1.git
%cd  machine_learning_1/ML_in_practice

Cloning into 'machine_learning_1'...
remote: Enumerating objects: 178, done.
remote: Counting objects: 100% (178/178), done.
remote: Compressing objects: 100% (131/131), done.
remote: Total 178 (delta 79), reused 143 (delta 44), pack-reused 0
Receiving objects: 100% (178/178), 34.11 MiB | 20.99 MiB/s, done.
Resolving deltas: 100% (79/79), done.
/content/machine_learning_1/ML_in_practice/machine_learning_1/ML_in_practice

In [31]:
import random as rd
rd.seed(0)

In [32]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## 12.1 Loading and exploring the dataset

First, we use pandas to load the dataset from a csv file.

In [47]:
# use pabdas to read './titanic.csv'
raw_data = pd.read_csv('./titanic.csv',sep=',')
raw_data

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

Next, we can explore the dataset.

In [48]:
# Use pandas to examine the length of the dataset
raw_data.shape

(891, 12)

In [49]:
# Use pandas to examine the columns in the dataset
raw_data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [50]:
# Use pandas to examine "survived" column (labels)

raw_data['Survived']

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [51]:
# Use pandas to exanine more than one column at the same time []

raw_data[["Name", "Age"]]

                                                  Name   Age
0                              Braund, Mr. Owen Harris  22.0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                               Heikkinen, Miss. Laina  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                             Allen, Mr. William Henry  35.0
..                                                 ...   ...
886                              Montvila, Rev. Juozas  27.0
887                       Graham, Miss. Margaret Edith  19.0
888           Johnston, Miss. Catherine Helen "Carrie"   NaN
889                              Behr, Mr. Karl Howell  26.0
890                                Dooley, Mr. Patrick  32.0

[891 rows x 2 columns]

In [52]:
# Use pandas to check how many passengers survived
sum(raw_data['Survived'])

342

## 12.2. Cleaning up the data

Now, let's look at how many columns have missing data

In [53]:
# use pandas to check missing data (NA(not available) values) for all the columns
raw_data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

The Cabin column is missing too many values to be useful. Let's drop it altogether.

In [54]:
# Use pandas to drop "Cabin" column
clean_data = raw_data.drop(columns='Cabin',axis=1)

In [55]:
clean_data

     PassengerId  Survived  Pclass  ...            Ticket     Fare  Embarked
0              1         0       3  ...         A/5 21171   7.2500         S
1              2         1       1  ...          PC 17599  71.2833         C
2              3         1       3  ...  STON/O2. 3101282   7.9250         S
3              4         1       1  ...            113803  53.1000         S
4              5         0       3  ...            373450   8.0500         S
..           ...       ...     ...  ...               ...      ...       ...
886          887         0       2  ...            211536  13.0000         S
887          888         1       1  ...            112053  30.0000         S
888          889         0       3  ...        W./C. 6607  23.4500         S
889          890         1       1  ...            111369  30.0000         C
890          891         0       3  ...            370376   7.7500         Q

[891 rows x 11 columns]

Other columns such as Age or Embarked are missing some values, but they can still be useful.

For the age column, let's fill in the missing values with the median of all ages.

For the Embarked column, let's make a new category called 'U', for Unknown port of embarkment.

In [56]:
# get the median of age column using pandas
median_age = raw_data['Age'].median()
median_age

28.0

In [58]:
# use pandas to fill the na values in age column with the median age
clean_data["Age"] =raw_data["Age"].fillna(median_age)

In [59]:
# use pandas to fill the na values in embarked column with 'U'

clean_data["Embarked"] = raw_data['Embarked'].fillna('U')

In [60]:
clean_data.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [62]:
# view 10 rows of the clean dataset
clean_data.head()

   PassengerId  Survived  Pclass  ...            Ticket     Fare  Embarked
0            1         0       3  ...         A/5 21171   7.2500         S
1            2         1       1  ...          PC 17599  71.2833         C
2            3         1       3  ...  STON/O2. 3101282   7.9250         S
3            4         1       1  ...            113803  53.1000         S
4            5         0       3  ...            373450   8.0500         S

[5 rows x 11 columns]

### 12.2.3 Saving our data for the future

In [65]:
# save the clean dataset to './clean_titanic_data.csv'
clean_data.to_csv('./clean_titanic_data1.csv',sep=',',index=None)

## 12.3 Manipulating the features

- One-hot encoding
- Binning
- Feature selection

### 12.3.1 One-hot encoding

In [66]:
preprocessed_data = pd.read_csv('clean_titanic_data1.csv')
preprocessed_data

     PassengerId  Survived  Pclass  ...            Ticket     Fare  Embarked
0              1         0       3  ...         A/5 21171   7.2500         S
1              2         1       1  ...          PC 17599  71.2833         C
2              3         1       3  ...  STON/O2. 3101282   7.9250         S
3              4         1       1  ...            113803  53.1000         S
4              5         0       3  ...            373450   8.0500         S
..           ...       ...     ...  ...               ...      ...       ...
886          887         0       2  ...            211536  13.0000         S
887          888         1       1  ...            112053  30.0000         S
888          889         0       3  ...        W./C. 6607  23.4500         S
889          890         1       1  ...            111369  30.0000         C
890          891         0       3  ...            370376   7.7500         Q

[891 rows x 11 columns]

In [69]:
# Use pandas method .get_dummies() to get the one hot encoding of “embarked”, “pclass” and “gender”

preprocessed_data=pd.get_dummies(preprocessed_data, columns = ['Embarked', 'Pclass', 'Sex'])

# Use pandas method .drop() to remove the old columns and method .concat() to add the new columns

In [71]:
preprocessed_data.columns

Index(['PassengerId', 'Survived', 'Name', 'Age', 'SibSp', 'Parch', 'Ticket',
       'Fare', 'Embarked_C', 'Embarked_Q', 'Embarked_S', 'Embarked_U',
       'Pclass_1', 'Pclass_2', 'Pclass_3', 'Sex_female', 'Sex_male'],
      dtype='object')

### 12.3.2 Binning

In [73]:
bins = [0, 10, 20, 30, 40, 50, 60, 70, 80]
# Use .cut() method to make bins from the age column

categorized_age =pd.cut(x=preprocessed_data['Age'], bins=[0, 10, 20, 30, 40, 50, 60, 70, 80])
preprocessed_data['Categorized_age'] = categorized_age
preprocessed_data = preprocessed_data.drop(["Age"], axis=1)
preprocessed_data

KeyError: ignored

In [74]:
# Use pandas method .get_dummies() to get the one hot encoding of “Categorized_age”
# Use pandas method .drop() to remove the old column and method .concat() to add the new columns
preprocessed_data=pd.get_dummies(preprocessed_data, columns = ['Categorized_age'])


preprocessed_data

     PassengerId  Survived  ... Categorized_age_(60, 70]  Categorized_age_(70, 80]
0              1         0  ...                        0                         0
1              2         1  ...                        0                         0
2              3         1  ...                        0                         0
3              4         1  ...                        0                         0
4              5         0  ...                        0                         0
..           ...       ...  ...                      ...                       ...
886          887         0  ...                        0                         0
887          888         1  ...                        0                         0
888          889         0  ...                        0                         0
889          890         1  ...                        0                         0
890          891         0  ...                        0                         0

[891 rows x 24 columns]

### 12.3.4 Feature selection

In [75]:
# drop these columns['Name', 'Ticket', 'PassengerId']

preprocessed_data=preprocessed_data.drop(columns=['Name', 'Ticket', 'PassengerId'],axis=1)

preprocessed_data.head()

   Survived  SibSp  ...  Categorized_age_(60, 70]  Categorized_age_(70, 80]
0         0      1  ...                         0                         0
1         1      1  ...                         0                         0
2         1      0  ...                         0                         0
3         1      1  ...                         0                         0
4         0      0  ...                         0                         0

[5 rows x 21 columns]

### 12.3.5 Saving for future use

In [76]:
preprocessed_data.to_csv('./preprocessed_titanic_data.csv', index=None)

# 12.4 Training models

In [77]:
data = pd.read_csv('./preprocessed_titanic_data.csv')
data.head()

   Survived  SibSp  ...  Categorized_age_(60, 70]  Categorized_age_(70, 80]
0         0      1  ...                         0                         0
1         1      1  ...                         0                         0
2         1      0  ...                         0                         0
3         1      1  ...                         0                         0
4         0      0  ...                         0                         0

[5 rows x 21 columns]

### 12.4.1 Features-labels split and train-validation split

In [79]:
# drop ["Survived"] column and save that to features
features = data.drop(columns=['Survived'])

# save the ["Survived"] column to labels
labels = data['Survived']

In [81]:
features

     SibSp  Parch  ...  Categorized_age_(60, 70]  Categorized_age_(70, 80]
0        1      0  ...                         0                         0
1        1      0  ...                         0                         0
2        0      0  ...                         0                         0
3        1      0  ...                         0                         0
4        0      0  ...                         0                         0
..     ...    ...  ...                       ...                       ...
886      0      0  ...                         0                         0
887      0      0  ...                         0                         0
888      1      2  ...                         0                         0
889      0      0  ...                         0                         0
890      0      0  ...                         0                         0

[891 rows x 20 columns]

In [82]:
from sklearn.model_selection import train_test_split

In [83]:
# split data by 60% train ; use random_state=100
features_train, features_validation_test, labels_train, labels_validation_test = train_test_split(features,labels,test_size=0.40,random_state=100)

In [85]:
# split test data by 50% validation and 50% test ; use random_state=100
features_validation, features_test, labels_validation, labels_test = train_test_split(features_validation_test,labels_validation_test,test_size=0.50,random_state=100)

In [86]:
print(len(features_train))
print(len(features_validation))
print(len(features_test))
print(len(labels_train))
print(len(labels_validation))
print(len(labels_test))

534
178
179
534
178
179

### 12.4.2 Training different models on our dataset

We'll train six models:
- Logistic regression (perceptron)
- Decision tree
- Support vector machine (SVM)
- RandomForestClassifier
- GradientBoostingClassifier
- AdaBoostClassifier

In [87]:
# Train logistic regression model
from sklearn.linear_model import LogisticRegression

lr_model = LogisticRegression().fit(features_train,labels_train)

/usr/local/lib/python3.7/dist-packages/sklearn/linear_model/_logistic.py:940: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  extra_warning_msg=_LOGISTIC_SOLVER_CONVERGENCE_MSG)

In [88]:
# Train decision tree model ; don't use any hyperparameter
from sklearn.tree import DecisionTreeClassifier

dt_model = DecisionTreeClassifier().fit(features_train,labels_train)

In [89]:
# Train SVM model ; don't use any hyperparameter
from sklearn.svm import SVC

svm_model = SVC().fit(features_train,labels_train)

In [90]:
# Train random forest model ; don't use any hyperparameter
from sklearn.ensemble import RandomForestClassifier

rf_model = RandomForestClassifier().fit(features_train,labels_train)

In [91]:
# Train gradient boosting model ; don't use any hyperparameter
from sklearn.ensemble import GradientBoostingClassifier

gb_model = GradientBoostingClassifier().fit(features_train,labels_train)

In [92]:
# Train Adaboost model ; don't use any hyperparameter
from sklearn.ensemble import AdaBoostClassifier

ab_model = AdaBoostClassifier().fit(features_train,labels_train)

### 12.4.3 Evaluating the models

#### Accuracy

In [93]:
# print accuracy of each model on validation data
print("Scores of the models")
print("Logistic regression:",lr_model.score(features_validation,labels_validation) )
print("Decision tree:", dt_model.score(features_validation,labels_validation))
print("SVM:", svm_model.score(features_validation,labels_validation))
print("Random forest:",rf_model.score(features_validation,labels_validation) )
print("Gradient boosting:",gb_model.score(features_validation,labels_validation) )
print("AdaBoost:",ab_model.score(features_validation,labels_validation) )

Scores of the models
Logistic regression: 0.7696629213483146
Decision tree: 0.7808988764044944
SVM: 0.6797752808988764
Random forest: 0.7752808988764045
Gradient boosting: 0.8146067415730337
AdaBoost: 0.7640449438202247

#### F1-score

In [94]:
# print F1-score of each model on validation data
from sklearn.metrics import f1_score

print("F1-scores of the models:")

lr_predicted_labels = lr_model.predict(features_validation)
print("Logistic regression:", f1_score(labels_validation, lr_predicted_labels))

dt_predicted_labels = dt_model.predict(features_validation)
print("Decision Tree:", f1_score(labels_validation, dt_predicted_labels))

svm_predicted_labels = svm_model.predict(features_validation)
print("Support Vector Machine:", f1_score(labels_validation, svm_predicted_labels))

rf_predicted_labels = rf_model.predict(features_validation)
print("Random Forest:", f1_score(labels_validation, rf_predicted_labels))

gb_predicted_labels = gb_model.predict(features_validation)
print("Gradient boosting:", f1_score(labels_validation, gb_predicted_labels))

ab_predicted_labels = ab_model.predict(features_validation)
print("AdaBoost:", f1_score(labels_validation, ab_predicted_labels))

F1-scores of the models:
Logistic regression: 0.6870229007633588
Decision Tree: 0.6976744186046511
Support Vector Machine: 0.39999999999999997
Random Forest: 0.7014925373134329
Gradient boosting: 0.744186046511628
AdaBoost: 0.6865671641791045

### 12.4.4 Testing the model

Finding the accuracy and the F1-score of the model in the testing set.

In [95]:
# print accuracy of gradient boost model on testing data
gb_model.score(features_test, labels_test)

0.8324022346368715

In [96]:
# print F1-score of gradient boost model on testing data
gb_predicted_test_labels = gb_model.predict(features_test)
f1_score(labels_test, gb_predicted_test_labels)

0.8026315789473685

# 12.5 Grid search

In [97]:
from sklearn.model_selection import GridSearchCV

In [102]:
svm_parameters = {'kernel': ['rbf'],
                  'C': [0.01, 0.1, 1 , 10, 100],
                  'gamma': [0.01, 0.1, 1, 10, 100]
                }
# use gridsearch to find the best hyperparameters
svm = SVC() 
svm_gs = GridSearchCV(estimator = svm,
                      param_grid = svm_parameters)
svm_gs.fit(features_train, labels_train)

svm_winner = svm_gs.best_estimator_
svm_winner

svm_winner.score(features_test, labels_test)

0.7877094972067039

In [100]:
svm_winner

SVC(C=10, break_ties=False, cache_size=200, class_weight=None, coef0=0.0,
    decision_function_shape='ovr', degree=3, gamma=0.01, kernel='rbf',
    max_iter=-1, probability=False, random_state=None, shrinking=True,
    tol=0.001, verbose=False)

# 12.6 Cross validation

In [101]:
# print the k-fold cross validation output
svm_gs.cv_results_

{'mean_fit_time': array([0.01134672, 0.01085873, 0.01145778, 0.01261196, 0.01055136,
        0.01109791, 0.01200819, 0.01149154, 0.01156783, 0.01089826,
        0.011166  , 0.01234121, 0.01236176, 0.01260781, 0.01139045,
        0.0134089 , 0.01320133, 0.01493702, 0.01343727, 0.01245694,
        0.01601472, 0.02065868, 0.01395044, 0.01374707, 0.01367164]),
 'mean_score_time': array([0.00362005, 0.0032989 , 0.00385814, 0.0035183 , 0.00322485,
        0.00325193, 0.00334086, 0.00355949, 0.00357809, 0.00330343,
        0.0030107 , 0.00365458, 0.00342355, 0.00387597, 0.00349507,
        0.00323567, 0.00295081, 0.00337701, 0.00347748, 0.00341725,
        0.00312729, 0.00310197, 0.00360379, 0.00355697, 0.00375838]),
 'mean_test_score': array([0.64607653, 0.64607653, 0.64607653, 0.64607653, 0.64607653,
        0.65730912, 0.64607653, 0.64607653, 0.64607653, 0.64607653,
        0.69851878, 0.76411568, 0.72294128, 0.69289367, 0.69664962,
        0.8071945 , 0.75469935, 0.72294128, 0.6929113 , 0.69476283,
        0.80340328, 0.74907424, 0.71359549, 0.69478046, 0.69476283]),
 'param_C': masked_array(data=[0.01, 0.01, 0.01, 0.01, 0.01, 0.1, 0.1, 0.1, 0.1, 0.1,
                    1, 1, 1, 1, 1, 10, 10, 10, 10, 10, 100, 100, 100, 100,
                    100],
              mask=[False, False, False, False, False, False, False, False,
                    False, False, False, False, False, False, False, False,
                    False, False, False, False, False, False, False, False,
                    False],
        fill_value='?',
             dtype=object),
 'param_gamma': masked_array(data=[0.01, 0.1, 1, 10, 100, 0.01, 0.1, 1, 10, 100, 0.01,
                    0.1, 1, 10, 100, 0.01, 0.1, 1, 10, 100, 0.01, 0.1, 1,
                    10, 100],
              mask=[False, False, False, False, False, False, False, False,
                    False, False, False, False, False, False, False, False,
                    False, False, False, False, False, False, False, False,
                    False],
        fill_value='?',
             dtype=object),
 'param_kernel': masked_array(data=['rbf', 'rbf', 'rbf', 'rbf', 'rbf', 'rbf', 'rbf', 'rbf',
                    'rbf', 'rbf', 'rbf', 'rbf', 'rbf', 'rbf', 'rbf', 'rbf',
                    'rbf', 'rbf', 'rbf', 'rbf', 'rbf', 'rbf', 'rbf', 'rbf',
                    'rbf'],
              mask=[False, False, False, False, False, False, False, False,
                    False, False, False, False, False, False, False, False,
                    False, False, False, False, False, False, False, False,
                    False],
        fill_value='?',
             dtype=object),
 'params': [{'C': 0.01, 'gamma': 0.01, 'kernel': 'rbf'},
  {'C': 0.01, 'gamma': 0.1, 'kernel': 'rbf'},
  {'C': 0.01, 'gamma': 1, 'kernel': 'rbf'},
  {'C': 0.01, 'gamma': 10, 'kernel': 'rbf'},
  {'C': 0.01, 'gamma': 100, 'kernel': 'rbf'},
  {'C': 0.1, 'gamma': 0.01, 'kernel': 'rbf'},
  {'C': 0.1, 'gamma': 0.1, 'kernel': 'rbf'},
  {'C': 0.1, 'gamma': 1, 'kernel': 'rbf'},
  {'C': 0.1, 'gamma': 10, 'kernel': 'rbf'},
  {'C': 0.1, 'gamma': 100, 'kernel': 'rbf'},
  {'C': 1, 'gamma': 0.01, 'kernel': 'rbf'},
  {'C': 1, 'gamma': 0.1, 'kernel': 'rbf'},
  {'C': 1, 'gamma': 1, 'kernel': 'rbf'},
  {'C': 1, 'gamma': 10, 'kernel': 'rbf'},
  {'C': 1, 'gamma': 100, 'kernel': 'rbf'},
  {'C': 10, 'gamma': 0.01, 'kernel': 'rbf'},
  {'C': 10, 'gamma': 0.1, 'kernel': 'rbf'},
  {'C': 10, 'gamma': 1, 'kernel': 'rbf'},
  {'C': 10, 'gamma': 10, 'kernel': 'rbf'},
  {'C': 10, 'gamma': 100, 'kernel': 'rbf'},
  {'C': 100, 'gamma': 0.01, 'kernel': 'rbf'},
  {'C': 100, 'gamma': 0.1, 'kernel': 'rbf'},
  {'C': 100, 'gamma': 1, 'kernel': 'rbf'},
  {'C': 100, 'gamma': 10, 'kernel': 'rbf'},
  {'C': 100, 'gamma': 100, 'kernel': 'rbf'}],
 'rank_test_score': array([17, 17, 17, 17, 17, 16, 17, 17, 17, 17,  9,  3,  6, 15, 10,  1,  4,
         6, 14, 12,  2,  5,  8, 11, 12], dtype=int32),
 'split0_test_score': array([0.64485981, 0.64485981, 0.64485981, 0.64485981, 0.64485981,
        0.65420561, 0.64485981, 0.64485981, 0.64485981, 0.64485981,
        0.71962617, 0.73831776, 0.6728972 , 0.70093458, 0.70093458,
        0.82242991, 0.71962617, 0.6728972 , 0.70093458, 0.70093458,
        0.80373832, 0.74766355, 0.6635514 , 0.70093458, 0.70093458]),
 'split1_test_score': array([0.64485981, 0.64485981, 0.64485981, 0.64485981, 0.64485981,
        0.65420561, 0.64485981, 0.64485981, 0.64485981, 0.64485981,
        0.64485981, 0.71028037, 0.68224299, 0.6635514 , 0.6635514 ,
        0.73831776, 0.73831776, 0.6728972 , 0.65420561, 0.6635514 ,
        0.76635514, 0.74766355, 0.64485981, 0.65420561, 0.6635514 ]),
 'split2_test_score': array([0.64485981, 0.64485981, 0.64485981, 0.64485981, 0.64485981,
        0.6728972 , 0.64485981, 0.64485981, 0.64485981, 0.64485981,
        0.71962617, 0.79439252, 0.73831776, 0.70093458, 0.71028037,
        0.81308411, 0.79439252, 0.75700935, 0.70093458, 0.71028037,
        0.82242991, 0.74766355, 0.73831776, 0.71028037, 0.71028037]),
 'split3_test_score': array([0.64485981, 0.64485981, 0.64485981, 0.64485981, 0.64485981,
        0.64485981, 0.64485981, 0.64485981, 0.64485981, 0.64485981,
        0.70093458, 0.77570093, 0.74766355, 0.70093458, 0.70093458,
        0.81308411, 0.75700935, 0.73831776, 0.70093458, 0.70093458,
        0.80373832, 0.74766355, 0.74766355, 0.70093458, 0.70093458]),
 'split4_test_score': array([0.6509434 , 0.6509434 , 0.6509434 , 0.6509434 , 0.6509434 ,
        0.66037736, 0.6509434 , 0.6509434 , 0.6509434 , 0.6509434 ,
        0.70754717, 0.80188679, 0.77358491, 0.69811321, 0.70754717,
        0.8490566 , 0.76415094, 0.77358491, 0.70754717, 0.69811321,
        0.82075472, 0.75471698, 0.77358491, 0.70754717, 0.69811321]),
 'std_fit_time': array([0.00136452, 0.00019034, 0.00030405, 0.00172201, 0.00038376,
        0.0002364 , 0.00085309, 0.00018579, 0.00058399, 0.00077721,
        0.00083319, 0.00134866, 0.00021219, 0.00128051, 0.00060439,
        0.00145735, 0.00071116, 0.00223884, 0.00061769, 0.0008535 ,
        0.00114977, 0.00248654, 0.00053914, 0.0004409 , 0.00142895]),
 'std_score_time': array([7.46527300e-04, 9.14673357e-05, 7.49879358e-04, 2.26505952e-04,
        1.20125398e-04, 1.46383928e-04, 8.89499555e-05, 2.03329627e-04,
        4.59854363e-04, 4.40143908e-04, 5.10448332e-05, 1.08674350e-03,
        8.79878396e-05, 7.26127556e-04, 7.17131422e-04, 3.57170977e-04,
        7.04962415e-05, 1.29114383e-04, 6.09236675e-04, 1.30579660e-04,
        4.46018817e-04, 5.42291116e-05, 1.23781783e-04, 9.03858638e-05,
        8.13184610e-04]),
 'std_test_score': array([0.00243343, 0.00243343, 0.00243343, 0.00243343, 0.00243343,
        0.00923744, 0.00243343, 0.00243343, 0.00243343, 0.00243343,
        0.02777652, 0.03476014, 0.03891829, 0.01471177, 0.01695151,
        0.03687258, 0.0251742 , 0.04235721, 0.01952157, 0.0161391 ,
        0.02017857, 0.00282137, 0.05019872, 0.02061699, 0.0161391 ])}